Backend/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "james"], ["created_at", "2020-08-16 21:05:05.542656"], ["updated_at", "2020-08-16 21:05:05.542656"]]
---
    def create
      @user = User.new(user_params)

      if @user.save